cmsis-svd/cmsis-svd/data/Spansion/MB9BF56xx_svd.xml
        <!-- REGISTER "OCU_OCCP0" -->
        <register>
          <name>OCU_OCCP0</name>
          <description> register OCU_OCCP0 </description>
          <addressOffset>0x102</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "OCU_OCCP1" -->
        <register derivedFrom="OCU_OCCP0">
          <name>OCU_OCCP1</name>
          <description> register OCU_OCCP1 </description>
          <addressOffset>0x106</addressOffset>
        </register>
        <!-- REGISTER "OCU_OCCP2" -->
        <register derivedFrom="OCU_OCCP0">
          <name>OCU_OCCP2</name>
          <description> register OCU_OCCP2 </description>
          <addressOffset>0x10A</addressOffset>
        </register>
        <!-- REGISTER "OCU_OCCP3" -->
        <register derivedFrom="OCU_OCCP0">
          <name>OCU_OCCP3</name>
          <description> register OCU_OCCP3 </description>
          <addressOffset>0x10E</addressOffset>
        </register>
        <!-- REGISTER "OCU_OCCP4" -->
        <register derivedFrom="OCU_OCCP0">
          <name>OCU_OCCP4</name>
          <description> register OCU_OCCP4 </description>
          <addressOffset>0x112</addressOffset>
        </register>
        <!-- REGISTER "OCU_OCCP5" -->
        <register derivedFrom="OCU_OCCP0">
          <name>OCU_OCCP5</name>
          <description> register OCU_OCCP5 </description>
          <addressOffset>0x116</addressOffset>
        </register>
        <!-- REGISTER "OCU_OCSA10" -->
        <register>
          <name>OCU_OCSA10</name>
          <description> register OCU_OCSA10 </description>
          <addressOffset>0x118</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xF3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IOP1" -->
            <field>
              <name>IOP1</name>
              <description> bitfield IOP1 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IOP0" -->
            <field>
              <name>IOP0</name>
              <description> bitfield IOP0 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IOE1" -->
            <field>
              <name>IOE1</name>
              <description> bitfield IOE1 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IOE0" -->
            <field>
              <name>IOE0</name>
              <description> bitfield IOE0 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CST1" -->
            <field>
              <name>CST1</name>
              <description> bitfield CST1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CST0" -->
            <field>
              <name>CST0</name>
              <description> bitfield CST0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "OCU_OCSB10" -->
        <register>
          <name>OCU_OCSB10</name>
          <description> register OCU_OCSB10 </description>
          <addressOffset>0x119</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x93</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FM4" -->
            <field>
              <name>FM4</name>
              <description> bitfield FM4 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CMOD" -->
            <field>
              <name>CMOD</name>
              <description> bitfield CMOD </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OTD1" -->
            <field>
              <name>OTD1</name>
              <description> bitfield OTD1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OTD0" -->
            <field>
              <name>OTD0</name>
              <description> bitfield OTD0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "OCU_OCSD10" -->
        <register>
          <name>OCU_OCSD10</name>
          <description> register OCU_OCSD10 </description>
          <addressOffset>0x11A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "OCSE1BUFE" -->
            <field>
              <name>OCSE1BUFE</name>
              <description> bitfield OCSE1BUFE </description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OCSE0BUFE" -->
            <field>
              <name>OCSE0BUFE</name>
              <description> bitfield OCSE0BUFE </description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OCCP1BUFE" -->
            <field>
              <name>OCCP1BUFE</name>
              <description> bitfield OCCP1BUFE </description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OCCP0BUFE" -->
            <field>
              <name>OCCP0BUFE</name>
              <description> bitfield OCCP0BUFE </description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "OCU_OCSA32" -->
        <register derivedFrom="OCU_OCSA10">
          <name>OCU_OCSA32</name>
          <description> register OCU_OCSA32 </description>
          <addressOffset>0x11C</addressOffset>
        </register>
        <!-- REGISTER "OCU_OCSB32" -->
        <register derivedFrom="OCU_OCSB10">
          <name>OCU_OCSB32</name>
          <description> register OCU_OCSB32 </description>
          <addressOffset>0x11D</addressOffset>
        </register>
        <!-- REGISTER "OCU_OCSD32" -->
        <register derivedFrom="OCU_OCSD10">
          <name>OCU_OCSD32</name>
          <description> register OCU_OCSD32 </description>
          <addressOffset>0x11E</addressOffset>
        </register>
        <!-- REGISTER "OCU_OCSA54" -->
        <register derivedFrom="OCU_OCSA10">
          <name>OCU_OCSA54</name>
          <description> register OCU_OCSA54 </description>
          <addressOffset>0x120</addressOffset>
        </register>
        <!-- REGISTER "OCU_OCSB54" -->
        <register derivedFrom="OCU_OCSB10">
          <name>OCU_OCSB54</name>
          <description> register OCU_OCSB54 </description>
          <addressOffset>0x121</addressOffset>
        </register>
        <!-- REGISTER "OCU_OCSD54" -->
        <register derivedFrom="OCU_OCSD10">
          <name>OCU_OCSD54</name>
          <description> register OCU_OCSD54 </description>
          <addressOffset>0x122</addressOffset>
        </register>
        <!-- REGISTER "OCU_OCSC" -->
        <register>
          <name>OCU_OCSC</name>
          <description> register OCU_OCSC </description>
          <addressOffset>0x124</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x3F00</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MOD5" -->
            <field>
              <name>MOD5</name>
              <description> bitfield MOD5 </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MOD4" -->
            <field>
              <name>MOD4</name>
              <description> bitfield MOD4 </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MOD3" -->
            <field>
              <name>MOD3</name>
              <description> bitfield MOD3 </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MOD2" -->
            <field>
              <name>MOD2</name>
              <description> bitfield MOD2 </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MOD1" -->
            <field>
              <name>MOD1</name>
              <description> bitfield MOD1 </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MOD0" -->
            <field>
              <name>MOD0</name>
              <description> bitfield MOD0 </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "OCU_OCSE0" -->
        <register>
          <name>OCU_OCSE0</name>
          <description> register OCU_OCSE0 </description>
          <addressOffset>0x128</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "OCSE" -->
            <field>
              <name>OCSE</name>
              <description> bitfield OCSE </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "OCU_OCSE1" -->
        <register>
          <name>OCU_OCSE1</name>
          <description> register OCU_OCSE1 </description>
          <addressOffset>0x12C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "OCSE" -->
            <field>
              <name>OCSE</name>
              <description> bitfield OCSE </description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "OCU_OCSE2" -->
        <register derivedFrom="OCU_OCSE0">
          <name>OCU_OCSE2</name>
          <description> register OCU_OCSE2 </description>
          <addressOffset>0x130</addressOffset>
        </register>
