cmsis-svd/cmsis-svd/data/Spansion/MB9BF56xx_svd.xml
        <!-- REGISTER "IRQ099MON" -->
        <register>
          <name>IRQ099MON</name>
          <description> register IRQ099MON </description>
          <addressOffset>0x390</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BTINT1" -->
            <field>
              <name>BTINT1</name>
              <description> bitfield BTINT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT0" -->
            <field>
              <name>BTINT0</name>
              <description> bitfield BTINT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ100MON" -->
        <register>
          <name>IRQ100MON</name>
          <description> register IRQ100MON </description>
          <addressOffset>0x394</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BTINT1" -->
            <field>
              <name>BTINT1</name>
              <description> bitfield BTINT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT0" -->
            <field>
              <name>BTINT0</name>
              <description> bitfield BTINT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ101MON" -->
        <register>
          <name>IRQ101MON</name>
          <description> register IRQ101MON </description>
          <addressOffset>0x398</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BTINT1" -->
            <field>
              <name>BTINT1</name>
              <description> bitfield BTINT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT0" -->
            <field>
              <name>BTINT0</name>
              <description> bitfield BTINT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ102MON" -->
        <register>
          <name>IRQ102MON</name>
          <description> register IRQ102MON </description>
          <addressOffset>0x39C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BTINT7" -->
            <field>
              <name>BTINT7</name>
              <description> bitfield BTINT7 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT6" -->
            <field>
              <name>BTINT6</name>
              <description> bitfield BTINT6 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT5" -->
            <field>
              <name>BTINT5</name>
              <description> bitfield BTINT5 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT4" -->
            <field>
              <name>BTINT4</name>
              <description> bitfield BTINT4 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT3" -->
            <field>
              <name>BTINT3</name>
              <description> bitfield BTINT3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT2" -->
            <field>
              <name>BTINT2</name>
              <description> bitfield BTINT2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT1" -->
            <field>
              <name>BTINT1</name>
              <description> bitfield BTINT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT0" -->
            <field>
              <name>BTINT0</name>
              <description> bitfield BTINT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ103MON" -->
        <register>
          <name>IRQ103MON</name>
          <description> register IRQ103MON </description>
          <addressOffset>0x3A0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSRINT" -->
            <field>
              <name>MFSRINT</name>
              <description> bitfield MFSRINT </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ104MON" -->
        <register>
          <name>IRQ104MON</name>
          <description> register IRQ104MON </description>
          <addressOffset>0x3A4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT1" -->
            <field>
              <name>MFSINT1</name>
              <description> bitfield MFSINT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT0" -->
            <field>
              <name>MFSINT0</name>
              <description> bitfield MFSINT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ105MON" -->
        <register>
          <name>IRQ105MON</name>
          <description> register IRQ105MON </description>
          <addressOffset>0x3A8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSRINT" -->
            <field>
              <name>MFSRINT</name>
              <description> bitfield MFSRINT </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ106MON" -->
        <register>
          <name>IRQ106MON</name>
          <description> register IRQ106MON </description>
          <addressOffset>0x3AC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT1" -->
            <field>
              <name>MFSINT1</name>
              <description> bitfield MFSINT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT0" -->
            <field>
              <name>MFSINT0</name>
              <description> bitfield MFSINT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
