cmsis-svd/cmsis-svd/data/Spansion/MB9BF56xx_svd.xml
        <!-- REGISTER "PFR4" -->
        <register>
          <name>PFR4</name>
          <description> register PFR4 </description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x00007FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P4E" -->
            <field>
              <name>P4E</name>
              <description> bitfield P4E </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P4D" -->
            <field>
              <name>P4D</name>
              <description> bitfield P4D </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P4C" -->
            <field>
              <name>P4C</name>
              <description> bitfield P4C </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P4B" -->
            <field>
              <name>P4B</name>
              <description> bitfield P4B </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P4A" -->
            <field>
              <name>P4A</name>
              <description> bitfield P4A </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P49" -->
            <field>
              <name>P49</name>
              <description> bitfield P49 </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P48" -->
            <field>
              <name>P48</name>
              <description> bitfield P48 </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P47" -->
            <field>
              <name>P47</name>
              <description> bitfield P47 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P46" -->
            <field>
              <name>P46</name>
              <description> bitfield P46 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P45" -->
            <field>
              <name>P45</name>
              <description> bitfield P45 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P44" -->
            <field>
              <name>P44</name>
              <description> bitfield P44 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P43" -->
            <field>
              <name>P43</name>
              <description> bitfield P43 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P42" -->
            <field>
              <name>P42</name>
              <description> bitfield P42 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P41" -->
            <field>
              <name>P41</name>
              <description> bitfield P41 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P40" -->
            <field>
              <name>P40</name>
              <description> bitfield P40 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PFR5" -->
        <register>
          <name>PFR5</name>
          <description> register PFR5 </description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P5B" -->
            <field>
              <name>P5B</name>
              <description> bitfield P5B </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P5A" -->
            <field>
              <name>P5A</name>
              <description> bitfield P5A </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P59" -->
            <field>
              <name>P59</name>
              <description> bitfield P59 </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P58" -->
            <field>
              <name>P58</name>
              <description> bitfield P58 </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P57" -->
            <field>
              <name>P57</name>
              <description> bitfield P57 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P56" -->
            <field>
              <name>P56</name>
              <description> bitfield P56 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P55" -->
            <field>
              <name>P55</name>
              <description> bitfield P55 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P54" -->
            <field>
              <name>P54</name>
              <description> bitfield P54 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P53" -->
            <field>
              <name>P53</name>
              <description> bitfield P53 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P52" -->
            <field>
              <name>P52</name>
              <description> bitfield P52 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P51" -->
            <field>
              <name>P51</name>
              <description> bitfield P51 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P50" -->
            <field>
              <name>P50</name>
              <description> bitfield P50 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PFR6" -->
        <register>
          <name>PFR6</name>
          <description> register PFR6 </description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P68" -->
            <field>
              <name>P68</name>
              <description> bitfield P68 </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P67" -->
            <field>
              <name>P67</name>
              <description> bitfield P67 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P66" -->
            <field>
              <name>P66</name>
              <description> bitfield P66 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P65" -->
            <field>
              <name>P65</name>
              <description> bitfield P65 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P64" -->
            <field>
              <name>P64</name>
              <description> bitfield P64 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P63" -->
            <field>
              <name>P63</name>
              <description> bitfield P63 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P62" -->
            <field>
              <name>P62</name>
              <description> bitfield P62 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P61" -->
            <field>
              <name>P61</name>
              <description> bitfield P61 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P60" -->
            <field>
              <name>P60</name>
              <description> bitfield P60 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
