cmsis-svd/cmsis-svd/data/Spansion/MB9BF56xx_svd.xml
        <!-- REGISTER "EPFR18" -->
        <register>
          <name>EPFR18</name>
          <description> register EPFR18 </description>
          <addressOffset>0x648</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFFC3F0</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SDWPS" -->
            <field>
              <name>SDWPS</name>
              <description> bitfield SDWPS </description>
              <lsb>28</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDCDS" -->
            <field>
              <name>SDCDS</name>
              <description> bitfield SDCDS </description>
              <lsb>26</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDDATA3B" -->
            <field>
              <name>SDDATA3B</name>
              <description> bitfield SDDATA3B </description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDDATA2B" -->
            <field>
              <name>SDDATA2B</name>
              <description> bitfield SDDATA2B </description>
              <lsb>22</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDDATA1B" -->
            <field>
              <name>SDDATA1B</name>
              <description> bitfield SDDATA1B </description>
              <lsb>20</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDDATA0B" -->
            <field>
              <name>SDDATA0B</name>
              <description> bitfield SDDATA0B </description>
              <lsb>18</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDCMDB" -->
            <field>
              <name>SDCMDB</name>
              <description> bitfield SDCMDB </description>
              <lsb>16</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDCLKE" -->
            <field>
              <name>SDCLKE</name>
              <description> bitfield SDCLKE </description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "QZIN3S" -->
            <field>
              <name>QZIN3S</name>
              <description> bitfield QZIN3S </description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "QBIN3S" -->
            <field>
              <name>QBIN3S</name>
              <description> bitfield QBIN3S </description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "QAIN3S" -->
            <field>
              <name>QAIN3S</name>
              <description> bitfield QAIN3S </description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR19" -->
        <register>
          <name>EPFR19</name>
          <description> register EPFR19 </description>
          <addressOffset>0x64C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "EPFR20" -->
        <register>
          <name>EPFR20</name>
          <description> register EPFR20 </description>
          <addressOffset>0x650</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x01FFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UED31B" -->
            <field>
              <name>UED31B</name>
              <description> bitfield UED31B </description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED30B" -->
            <field>
              <name>UED30B</name>
              <description> bitfield UED30B </description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED29B" -->
            <field>
              <name>UED29B</name>
              <description> bitfield UED29B </description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED28B" -->
            <field>
              <name>UED28B</name>
              <description> bitfield UED28B </description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED27B" -->
            <field>
              <name>UED27B</name>
              <description> bitfield UED27B </description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED26B" -->
            <field>
              <name>UED26B</name>
              <description> bitfield UED26B </description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED25B" -->
            <field>
              <name>UED25B</name>
              <description> bitfield UED25B </description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED24B" -->
            <field>
              <name>UED24B</name>
              <description> bitfield UED24B </description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED23B" -->
            <field>
              <name>UED23B</name>
              <description> bitfield UED23B </description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED22B" -->
            <field>
              <name>UED22B</name>
              <description> bitfield UED22B </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED21B" -->
            <field>
              <name>UED21B</name>
              <description> bitfield UED21B </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED20B" -->
            <field>
              <name>UED20B</name>
              <description> bitfield UED20B </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED19B" -->
            <field>
              <name>UED19B</name>
              <description> bitfield UED19B </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED18B" -->
            <field>
              <name>UED18B</name>
              <description> bitfield UED18B </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED17B" -->
            <field>
              <name>UED17B</name>
              <description> bitfield UED17B </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED16B" -->
            <field>
              <name>UED16B</name>
              <description> bitfield UED16B </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEDTHHB" -->
            <field>
              <name>UEDTHHB</name>
              <description> bitfield UEDTHHB </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEDQM3E" -->
            <field>
              <name>UEDQM3E</name>
              <description> bitfield UEDQM3E </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEDQM2E" -->
            <field>
              <name>UEDQM2E</name>
              <description> bitfield UEDQM2E </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UECSXE" -->
            <field>
              <name>UECSXE</name>
              <description> bitfield UECSXE </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEDWEXE" -->
            <field>
              <name>UEDWEXE</name>
              <description> bitfield UEDWEXE </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UECASE" -->
            <field>
              <name>UECASE</name>
              <description> bitfield UECASE </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UERASE" -->
            <field>
              <name>UERASE</name>
              <description> bitfield UERASE </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UESMCEE" -->
            <field>
              <name>UESMCEE</name>
              <description> bitfield UESMCEE </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UESMCKE" -->
            <field>
              <name>UESMCKE</name>
              <description> bitfield UESMCKE </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
