cmsis-svd/cmsis-svd/data/Spansion/MB9BF56xx_svd.xml
        <!-- REGISTER "WTCAL1" -->
        <register>
          <name>WTCAL1</name>
          <description> register WTCAL1 </description>
          <addressOffset>0x15C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WTCAL1" -->
            <field>
              <name>WTCAL1</name>
              <description> bitfield WTCAL1 </description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTCALEN" -->
        <register>
          <name>WTCALEN</name>
          <description> register WTCALEN </description>
          <addressOffset>0x160</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WTCALEN" -->
            <field>
              <name>WTCALEN</name>
              <description> bitfield WTCALEN </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTDIV" -->
        <register>
          <name>WTDIV</name>
          <description> register WTDIV </description>
          <addressOffset>0x164</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WTDIV" -->
            <field>
              <name>WTDIV</name>
              <description> bitfield WTDIV </description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTDIVEN" -->
        <register>
          <name>WTDIVEN</name>
          <description> register WTDIVEN </description>
          <addressOffset>0x168</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WTDIVRDY" -->
            <field>
              <name>WTDIVRDY</name>
              <description> bitfield WTDIVRDY </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WTDIVEN" -->
            <field>
              <name>WTDIVEN</name>
              <description> bitfield WTDIVEN </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTCALPRD" -->
        <register>
          <name>WTCALPRD</name>
          <description> register WTCALPRD </description>
          <addressOffset>0x16C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x13</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WTCALPRD" -->
            <field>
              <name>WTCALPRD</name>
              <description> bitfield WTCALPRD </description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTCOSEL" -->
        <register>
          <name>WTCOSEL</name>
          <description> register WTCOSEL </description>
          <addressOffset>0x170</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WTCOSEL" -->
            <field>
              <name>WTCOSEL</name>
              <description> bitfield WTCOSEL </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "VB_CLKDIV" -->
        <register>
          <name>VB_CLKDIV</name>
          <description> register VB_CLKDIV </description>
          <addressOffset>0x174</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x07</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DIV" -->
            <field>
              <name>DIV</name>
              <description> bitfield DIV </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTOSCCNT" -->
        <register>
          <name>WTOSCCNT</name>
          <description> register WTOSCCNT </description>
          <addressOffset>0x178</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x01</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SOSCNTL" -->
            <field>
              <name>SOSCNTL</name>
              <description> bitfield SOSCNTL </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOSCEX" -->
            <field>
              <name>SOSCEX</name>
              <description> bitfield SOSCEX </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CCS" -->
        <register>
          <name>CCS</name>
          <description> register CCS </description>
          <addressOffset>0x17C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x08</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
