cmsis-svd/cmsis-svd/data/Spansion/MB9BF56xx_svd.xml
        <!-- REGISTER "BREG5E" -->
        <register>
          <name>BREG5E</name>
          <description> register BREG5E </description>
          <addressOffset>0x25E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG5F" -->
        <register>
          <name>BREG5F</name>
          <description> register BREG5F </description>
          <addressOffset>0x25F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG60" -->
        <register>
          <name>BREG60</name>
          <description> register BREG60 </description>
          <addressOffset>0x260</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG61" -->
        <register>
          <name>BREG61</name>
          <description> register BREG61 </description>
          <addressOffset>0x261</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG62" -->
        <register>
          <name>BREG62</name>
          <description> register BREG62 </description>
          <addressOffset>0x262</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG63" -->
        <register>
          <name>BREG63</name>
          <description> register BREG63 </description>
          <addressOffset>0x263</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG64" -->
        <register>
          <name>BREG64</name>
          <description> register BREG64 </description>
          <addressOffset>0x264</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG65" -->
        <register>
          <name>BREG65</name>
          <description> register BREG65 </description>
          <addressOffset>0x265</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG66" -->
        <register>
          <name>BREG66</name>
          <description> register BREG66 </description>
          <addressOffset>0x266</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG67" -->
        <register>
          <name>BREG67</name>
          <description> register BREG67 </description>
          <addressOffset>0x267</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG68" -->
        <register>
          <name>BREG68</name>
          <description> register BREG68 </description>
          <addressOffset>0x268</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG69" -->
        <register>
          <name>BREG69</name>
          <description> register BREG69 </description>
          <addressOffset>0x269</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG6A" -->
        <register>
          <name>BREG6A</name>
          <description> register BREG6A </description>
          <addressOffset>0x26A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG6B" -->
        <register>
          <name>BREG6B</name>
          <description> register BREG6B </description>
          <addressOffset>0x26B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG6C" -->
        <register>
          <name>BREG6C</name>
          <description> register BREG6C </description>
          <addressOffset>0x26C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG6D" -->
        <register>
          <name>BREG6D</name>
          <description> register BREG6D </description>
          <addressOffset>0x26D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG6E" -->
        <register>
          <name>BREG6E</name>
          <description> register BREG6E </description>
          <addressOffset>0x26E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG6F" -->
        <register>
          <name>BREG6F</name>
          <description> register BREG6F </description>
          <addressOffset>0x26F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG70" -->
        <register>
          <name>BREG70</name>
          <description> register BREG70 </description>
          <addressOffset>0x270</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG71" -->
        <register>
          <name>BREG71</name>
          <description> register BREG71 </description>
          <addressOffset>0x271</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
