cmsis-svd/cmsis-svd/data/Spansion/MB9BF56xx_svd.xml
        <!-- REGISTER "BREG72" -->
        <register>
          <name>BREG72</name>
          <description> register BREG72 </description>
          <addressOffset>0x272</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG73" -->
        <register>
          <name>BREG73</name>
          <description> register BREG73 </description>
          <addressOffset>0x273</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG74" -->
        <register>
          <name>BREG74</name>
          <description> register BREG74 </description>
          <addressOffset>0x274</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG75" -->
        <register>
          <name>BREG75</name>
          <description> register BREG75 </description>
          <addressOffset>0x275</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG76" -->
        <register>
          <name>BREG76</name>
          <description> register BREG76 </description>
          <addressOffset>0x276</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG77" -->
        <register>
          <name>BREG77</name>
          <description> register BREG77 </description>
          <addressOffset>0x277</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG78" -->
        <register>
          <name>BREG78</name>
          <description> register BREG78 </description>
          <addressOffset>0x278</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG79" -->
        <register>
          <name>BREG79</name>
          <description> register BREG79 </description>
          <addressOffset>0x279</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG7A" -->
        <register>
          <name>BREG7A</name>
          <description> register BREG7A </description>
          <addressOffset>0x27A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG7B" -->
        <register>
          <name>BREG7B</name>
          <description> register BREG7B </description>
          <addressOffset>0x27B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG7C" -->
        <register>
          <name>BREG7C</name>
          <description> register BREG7C </description>
          <addressOffset>0x27C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG7D" -->
        <register>
          <name>BREG7D</name>
          <description> register BREG7D </description>
          <addressOffset>0x27D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG7E" -->
        <register>
          <name>BREG7E</name>
          <description> register BREG7E </description>
          <addressOffset>0x27E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG7F" -->
        <register>
          <name>BREG7F</name>
          <description> register BREG7F </description>
          <addressOffset>0x27F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "LCR" -->
    <peripheral>
      <name>LCR</name>
      <description> peripheral LCR </description>
      <groupName>LCR</groupName>
      <baseAddress>0x4003C000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "LCR_PRSLD" -->
        <register>
          <name>LCR_PRSLD</name>
          <description> register LCR_PRSLD </description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCR_PRSLD" -->
            <field>
              <name>LCR_PRSLD</name>
              <description> bitfield LCR_PRSLD </description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
