cmsis-svd/cmsis-svd/data/Spansion/MB9BF56xx_svd.xml
        <!-- REGISTER "IF1MCTR" -->
        <register>
          <name>IF1MCTR</name>
          <description> register IF1MCTR </description>
          <addressOffset>0x1C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFF8F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "NEWDAT" -->
            <field>
              <name>NEWDAT</name>
              <description> bitfield NEWDAT </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSGLST" -->
            <field>
              <name>MSGLST</name>
              <description> bitfield MSGLST </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTPND" -->
            <field>
              <name>INTPND</name>
              <description> bitfield INTPND </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UMASK" -->
            <field>
              <name>UMASK</name>
              <description> bitfield UMASK </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TXIE" -->
            <field>
              <name>TXIE</name>
              <description> bitfield TXIE </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RXIE" -->
            <field>
              <name>RXIE</name>
              <description> bitfield RXIE </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RMTEN" -->
            <field>
              <name>RMTEN</name>
              <description> bitfield RMTEN </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TXRQST" -->
            <field>
              <name>TXRQST</name>
              <description> bitfield TXRQST </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EOB" -->
            <field>
              <name>EOB</name>
              <description> bitfield EOB </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DLC" -->
            <field>
              <name>DLC</name>
              <description> bitfield DLC </description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IF1DTA1_L" -->
        <register>
          <name>IF1DTA1_L</name>
          <description> register IF1DTA1_L </description>
          <addressOffset>0x20</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFF8F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DATA_1_" -->
            <field>
              <name>DATA_1_</name>
              <description> bitfield DATA_1_ </description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATA_0_" -->
            <field>
              <name>DATA_0_</name>
              <description> bitfield DATA_0_ </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IF1DTA2_L" -->
        <register>
          <name>IF1DTA2_L</name>
          <description> register IF1DTA2_L </description>
          <addressOffset>0x22</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DATA_3_" -->
            <field>
              <name>DATA_3_</name>
              <description> bitfield DATA_3_ </description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATA_2_" -->
            <field>
              <name>DATA_2_</name>
              <description> bitfield DATA_2_ </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IF1DTB1_L" -->
        <register>
          <name>IF1DTB1_L</name>
          <description> register IF1DTB1_L </description>
          <addressOffset>0x24</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DATA_5_" -->
            <field>
              <name>DATA_5_</name>
              <description> bitfield DATA_5_ </description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATA_4_" -->
            <field>
              <name>DATA_4_</name>
              <description> bitfield DATA_4_ </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
